cd %USERPROFILE%\git

: common
: データベース演習課題用リポジトリー
cd ./strutsdb
git pull
: Springフレームワーク練習用サンプルアプリケーション
cd ../spring
git pull
:
cd ../openconnect
git pull
: プロトタイプ
cd ../prototype
git pull
: プロトタイプ2014年11月
cd ../prototype_11
git pull
: プロトタイプ2015年09月
cd ../prototype1509
git pull
: プロトタイプ2015年11月
cd ../prototype1511
git pull
: プロトタイプ2015年11月
cd ../prototype1511u2
git pull
: プロトタイプ2015年12月
cd ../prototype1512
git pull
: プロトタイプ2015年12月
cd ../prototype1512u2
git pull
cd ../openconnect1505
git pull

: プロトタイプ2016年01月
cd ../prototype1601
git pull
: プロトタイプ2016年02月
cd ../prototype1602
git pull
: プロトタイプ2016年03月
cd ../prototype1603
git pull
: プロトタイプ2016年04月
cd ../prototype1604
git pull
: プロトタイプ2016年05月
cd ../prototype1605
git pull
: プロトタイプ2016年06月
cd ../prototype1606
git pull
: プロトタイプ2016年07月
cd ../prototype1607
git pull
: プロトタイプ2016年08月
cd ../prototype1608
git pull
: プロトタイプ2016年10月
cd ../prototype1610
git pull
: プロトタイプ2016年11月
cd ../prototype1611
git pull
: プロトタイプ2016年12月
cd ../prototype1612red
git pull
cd ../prototype1612blue
git pull

cd ../releaseproject
git pull

: cd ../java
git pull
cd ../mypage
git pull
cd ../provisioning
git pull
cd ../fcblogin
git pull
cd ../rate-exchanger
git pull

cd ../creditcard
git pull

: -------------------------------------------------------------------------------------------------
: 201407 <201407月生>
: -------------------------------------------------------------------------------------------------
: 2014年08月作成
: --- 某中小企業向け 書籍管理サイト[bookmanager07]
cd ../bookmanager07
git pull

: 2014年09月作成
: --- 某ショッピングサイト[shop]
cd ../shop
git pull

: -------------------------------------------------------------------------------------------------
: 201408 <201408月生>
: -------------------------------------------------------------------------------------------------
: 2014年09月作成
: --- <成果物なし>

: 2014年10月作成
: --- <成果物なし>
: -------------------------------------------------------------------------------------------------
: 201409 <201409月生>
: -------------------------------------------------------------------------------------------------
: 201410月作成
: --- 某大手書店向け 書籍管理サイト[bookmanager09]
cd ../bookmanager09
git pull

: 2014年11月作成
: --- 某通販企業向けショッピングモールサイト[-凍結-]
: <凍結>

: -------------------------------------------------------------------------------------------------
: 201410 <201410月生>
: -------------------------------------------------------------------------------------------------
: 2014年11月作成
: --- 某大手書店向けショッピングモールサイト[bookmanager]
: <凍結?>

: 2014年12月作成
: --- 日本酒・地酒販売サイト[ec_10,ec_b_10]
cd ../ec_b_10
git pull

: -------------------------------------------------------------------------------------------------
: 201411 <201411月生>
: -------------------------------------------------------------------------------------------------
: 2014年12月作成
: --- 某企業向け勤怠管理サイト[-凍結-]
: cd ../attendance
git pull

: 2015年01月作成
: 某フィギュア・ホビー販売サイト[ec_11a]  A環境の為、コメントアウト。
: cd ../EC_11a
git pull

 某フィギュア・ホビー販売サイト[ec_11]
cd ../EC_11
git pull

: -------------------------------------------------------------------------------------------------
: 201412 <201412月生>
: -------------------------------------------------------------------------------------------------
: 2015年01月作成
: 某大手企業向け 勤怠管理サイト（改修版）
cd ../attendance_12
git pull

: 2015年02月作成
: --- 某総合チケット販売サイト[chikezon]
: cd ../chikezon
git pull

: 某総合チケット販売サイト<phase2 2016/>
cd ../chikezon
git pull

: -------------------------------------------------------------------------------------------------
: 201501 <201501月生>
: -------------------------------------------------------------------------------------------------
: 2015年02月作成
: 某サッカーチケット販売サイト [sakatike]
cd ../sakatike
git pull

: 2015年02月作成
: 某通信販売会社 おでん通販サイト[oden]
cd ../oden
git pull

: 21015年03月作成
: 某健康通信販売サイト［uesto］
cd ../uesto
git pull

: -------------------------------------------------------------------------------------------------
: 201502 <201502月生>
: -------------------------------------------------------------------------------------------------
: 2015年03月作成
: 某旅行会社向け 旅行チケット販売サイト
cd ../tourticket
git pull

: 2015年04月作成
: 某飲食店向け 予約サイト[solare]
: cd ../solare

: 某飲食店向け 予約サイト[solare]
git clone -b phase2 https://github.com/internousdevwork/solare


: -------------------------------------------------------------------------------------------------
: 201503 <201503月生>
: -------------------------------------------------------------------------------------------------
: 2015年04月作成
: 某旅行会社向け 旅行チケット販売サイト
cd ../worldtravel

: 2015年04月作成
: 某旅行会社向け 宝石発掘ツアー予約サイト[youjustjewelry]
cd ../youjustjewelry

: 2015年05月作成
: 某一般消費者向け コーヒー豆販売サイト
cd ../gpscoffee

: -------------------------------------------------------------------------------------------------
: 201504 <201504月生>
: -------------------------------------------------------------------------------------------------
: 2015年05月作成
: 某フィギュア・ホビー販売サイト（改修版）
: cd ../lapoupee
: 某フィギュア・ホビー販売サイト（改修版）
git clone -b phase2 https://github.com/internousdevwork/lapoupee
: 2015年06月作成
: 某自転車レンタルサイト
cd ../ucycle

: -------------------------------------------------------------------------------------------------
: 201505 <201505月生>
: -------------------------------------------------------------------------------------------------
: 2015年06月作成
: 某ライブチケット販売サイト
cd ../livetickets

: 2015年06月作成
: 某野球観戦チケット販売サイト
:cd ../baseballticket

: 2015年07月作成
: 某着物レンタルサイト
cd ../ichigoichie

: -------------------------------------------------------------------------------------------------
: 201506 <201506月生>
: -------------------------------------------------------------------------------------------------
: 2015年07月作成
: 某ゲーム・ミュージックコンサートチケット販売専門サイト
:cd ../g-tickets


: 2015年07月作成
: 某映画館向け 映画鑑賞チケット販売サイト
cd ../movietickets

: 2015年08月作成
: 某Tシャツ販売サイト
:cd ../tbox

: -------------------------------------------------------------------------------------------------
: 201507 <201507月生>
: -------------------------------------------------------------------------------------------------
: 2015年08月作成
: 某プラネタリウム向け上映プログラムチケット販売サイト
:cd ../biggalaxy
: 2015年09月作成
: 某コテージレンタル予約サイト
cd ../k-home

: -------------------------------------------------------------------------------------------------
: 201508 <201508月生>
: -------------------------------------------------------------------------------------------------
: 2015年09月作成
:  某水族館向けチケット販売サイト
:cd ../aquarium

: 2015年09月作成
:  某水族館向けチケット販売サイト
cd ../aquarium
: -------------------------------------------------------------------------------------------------
: 201509 <201509月生>
: -------------------------------------------------------------------------------------------------
: 2015年10月作成
: 某ミュージカル劇団向けチケットサイト販売サイト
cd ../lereve
: 2015年11月作成
: 某書籍レーベルサイト向け 書籍販売サイト
cd ../shizuku

: -------------------------------------------------------------------------------------------------
: 201510 <201510月生>
: -------------------------------------------------------------------------------------------------
: 2015年11月作成
: 某旅行代理店向け チケット販売サイト
cd ../footprinter

: 2015年11月作成
: 某スポーツジム向け チケット販売サイト
cd ../ukiukiutopia

: 2015年12月作成
: 某ピザ配達会社向け ピザ販売サイト
cd ../pizzaseijin

: -------------------------------------------------------------------------------------------------
: 201511 <201511月生>
: -------------------------------------------------------------------------------------------------
: 2015年12月作成
: 某一般消費者向け 総合映画チケット販売サイト
git clone -b phase2 https://github.com/internousdevwork/cinemajapan

: 2016年01月作成
: 某一般消費者向け チョコレート販売サイト
cd ../chocotime

: -------------------------------------------------------------------------------------------------
: 201512 <201512月生>
: -------------------------------------------------------------------------------------------------
: 2016年01月作成
: 某一般消費者向け 落語チケット販売サイト
cd ../rakuraku
: 2016年02月作成
: 某一般消費者向け 和菓子販売サイト
cd ../kinnosawa

: -------------------------------------------------------------------------------------------------
: 201601 <201601月生>
: -------------------------------------------------------------------------------------------------
: 2016年02月作成
: 某一般消費者向け テーマパークチケット販売サイト
cd ../mackeypark
: 2016年03月作成
: 某一般消費者向け ラーメン販売サイト
cd ../kuruyama

: -------------------------------------------------------------------------------------------------
: 201602 <201602月生>
: -------------------------------------------------------------------------------------------------
: 2016年03月作成
: 一般消費者向け 舞台チケット予約サイト
cd ../gekidanroadshow

: 2016年04月作成
: 某着物レンタルサイト
git clone -b phase2 https://github.com/internousdevwork/ichigoichie

: クレジットカード会社 VISA
:cd ../visa

: -------------------------------------------------------------------------------------------------
: 201603 <201601月生及び201602月生>
: -------------------------------------------------------------------------------------------------

: -------------------------------------------------------------------------------------------------
: 201604 <201602月生及び201603月生>
: -------------------------------------------------------------------------------------------------

: -------------------------------------------------------------------------------------------------
: 201605 <201603月生及び201604月生>
: -------------------------------------------------------------------------------------------------

: -------------------------------------------------------------------------------------------------
: 201606 <201604月生及び201605月生>
: -------------------------------------------------------------------------------------------------
: 某ライブチケット販売サイト[liveticket]
git clone -b phase2 https://github.com/internousdevwork/liveticket

: 某野球観戦チケット販売サイト[baseballticket]
git clone -b phase2 https://github.com/internousdevwork/baseballticket

: 某着物レンタルサイト[ichigoichie]
git clone -b phase3 https://github.com/internousdevwork/ichigoichie

: 某Tシャツ販売サイト[tbox]
git clone -b phase2 https://github.com/internousdevwork/tbox

: 某プラネタリウム向け上映プログラムチケット販売サイト[biggalaxy]
git clone -b phase2 https://github.com/internousdevwork/biggalaxy

: 一般消費者向け 総合映画チケット販売サイト[cinemajapan]
git clone -b phase2 https://github.com/internousdevwork/cinemajapan

: -------------------------------------------------------------------------------------------------
: 201607 <201605月生及び201606月生>
: -------------------------------------------------------------------------------------------------
: オウンドメディアサイト INTERNOUSDEV
cd ../internousdev
: プログラマカレッジ向け 統合認証基盤[openconnect]
:cd ../openconnect
: クレジットカード会社 VISA
git clone -b phase2 https://github.com/internousdevwork/visa

: -------------------------------------------------------------------------------------------------
: 201608 <201606月生及び201607月生>
: -------------------------------------------------------------------------------------------------
: オウンドメディアサイト INTERNOUSDEV
cd ../internousdev

: 一般消費者向け ファッションキュレーション型ECサイト
cd ../mira-mode

: 一般消費者向け
cd ../rewrite
 : -------------------------------------------------------------------------------------------------
: 201609 <201607月生及び201608月生>
: -------------------------------------------------------------------------------------------------
: オウンドメディアサイト INTERNOUSDEV
cd ../internousdev

:プログラマカレッジ向け 統合認証基盤[openconnect]
cd ../openconnect

: クレジットカード会社 AMERICAN EXPRESS
cd ../americanexpress

: -------------------------------------------------------------------------------------------------
: 201610 <201608月生及び201609月生>
: -------------------------------------------------------------------------------------------------
: 某一般消費者向け 温泉旅館予約サイト
cd ../nagomi

: -------------------------------------------------------------------------------------------------
: 201611 <201609月生及び201610月生>
: -------------------------------------------------------------------------------------------------
: 某一般消費者向け ケーキ販売サイト
cd ../noel
: 某富裕層向け アルコール等販売サイト
cd ../lusso

: -------------------------------------------------------------------------------------------------
: 201612 <201610月生>
: -------------------------------------------------------------------------------------------------
: 一般消費者向け キュレーション型ECサイト
cd ../shiki

: 一般消費者向け 商材販売サイト
cd ../debut

: -------------------------------------------------------------------------------------------------
: 201612 <201611月生>
: -------------------------------------------------------------------------------------------------
: 一般消費者向け 着物レンタル及び販売サイト
cd ../nadeshiko

: -------------------------------------------------------------------------------------------------
: 201701 <201611月生>
: -------------------------------------------------------------------------------------------------
: 一般消費者向け バレンタイン商品販売サイト
cd ../cadeau


cd ../kamakura

: -------------------------------------------------------------------------------------------------
: 201701 <201612月生>
: -------------------------------------------------------------------------------------------------
: 一般消費者向け 東京マラソン商品販売サイト
cd ../tokyorunner

: 一般消費者向け バレンタイン商品販売サイト
cd ../valentine



PAUSE