%~d0
cd %~p0


: -------------------------------------------------------------------------------------------------
: common01 <カレッジ共通基盤プロジェクト>
: -------------------------------------------------------------------------------------------------
mysql -u root -pmysql < ./../../../sql/common01-strutsdb.sql
mysql -u root -pmysql < ./../../../sql/common01-spring.sql
mysql -u root -pmysql < ./../../../sql/common01-openconnect.sql
mysql -u root -pmysql < ./../../../sql/common01-openconnect1505.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1411.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1509.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1511.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1511u2.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1512.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1512u2.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1601.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1602.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1603.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1604.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1605.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1606.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1607.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1608.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1610.sql
mysql -u root -pmysql < ./../../../sql/common01-prototype1611.sql

mysql -u root -pmysql < ./../../../sql/common01-releaseproject.sql
mysql -u root -pmysql < ./../../../sql/common01-java.sql
mysql -u root -pmysql < ./../../../sql/common01-mypage.sql
mysql -u root -pmysql < ./../../../sql/common01-provisioning.sql
mysql -u root -pmysql < ./../../../sql/common01-fcblogin.sql
mysql -u root -pmysql < ./../../../sql/common01-rate-exchanger.sql
mysql -u root -pmysql < ./../../../sql/common01-creditcard.sql

: -------------------------------------------------------------------------------------------------
: 201407 <201407月生>
: -------------------------------------------------------------------------------------------------
: 2014年08月作成
: --- 某中小企業向け 書籍管理サイト[bookmanager07]
mysql -u root -pmysql < ./../../../sql/20140701-bookmanager07.sql

: 2014年09月作成
: --- 某ショッピングサイト[shop]
mysql -u root -pmysql < ./../../../sql/20140701-shop.sql

: -------------------------------------------------------------------------------------------------
: 201408 <201408月生>
: -------------------------------------------------------------------------------------------------
: 2014年09月作成
: --- <成果物なし>

: 2014年10月作成
: --- <成果物なし>

: -------------------------------------------------------------------------------------------------
: 201409 <201409月生>
: -------------------------------------------------------------------------------------------------
: 201410月作成
: --- 某大手書店向け 書籍管理サイト[bookmanager09]
mysql -u root -pmysql < ./../../../sql/20140901-bookmanager-phase1.sql

: 2014年11月作成
: --- 某通販企業向けショッピングモールサイト[-凍結-]
: mysql -u root -pmysql < ./../../../sql/

: -------------------------------------------------------------------------------------------------
: 201410 <201410月生>
: -------------------------------------------------------------------------------------------------
: 2014年11月作成
: --- 某大手書店向けショッピングモールサイト[bookmanager]
: mysql -u root -pmysql < ./../../../sql/20141001-

: 2014年12月作成
: --- 日本酒・地酒販売サイト[ec_10,ec_b_10]
mysql -u root -pmysql < ./../../../sql/20141001-ec10-phase1.sql

: -------------------------------------------------------------------------------------------------
: 201411 <201411月生>
: -------------------------------------------------------------------------------------------------
: --- 某企業向け勤怠管理サイト[-凍結-]
mysql -u root -pmysql < ./../../../sql/20141101-attendance-phase1.sql

: 2015年01月作成
: --- 某フィギュア・ホビー販売サイト[ec_11,ec_11a]
: mysql -u root -pmysql < ./../../../sql/

: -------------------------------------------------------------------------------------------------
: 201412 <201412月生>
: -------------------------------------------------------------------------------------------------
: 2015年01月作成
: --- 某大手企業向け 勤怠管理サイト（改修版） [attendance_12]
: mysql -u root -pmysql < ./../../../sql/

: 2015年02月作成
: --- 某総合チケット販売サイト[chikezon]
mysql -u root -pmysql < ./../../../sql/20141202-chikezon-phase1.sql

: -------------------------------------------------------------------------------------------------
: 201501 <201501月生>
: -------------------------------------------------------------------------------------------------
: 2015年02月作成
: --- 某通信販売会社 おでん通販サイト[oden]
mysql -u root -pmysql < ./../../../sql/20150101-oden-phase1.sql

: 2015年02月作成
: --- サッカーチケット販売サイト[sakatike]
mysql -u root -pmysql < ./../../../sql/20151501-sakatike-phase1.sql

: 21015年03月作成
: --- 某健康通信販売サイト［uesto］
mysql -u root -pmysql < ./../../../sql/20150102-uesto-phase1.sql

: -------------------------------------------------------------------------------------------------
: 201502 <201502月生>
: -------------------------------------------------------------------------------------------------
: 2015年03月作成
: --- 某旅行会社向け 旅行チケット販売サイト[tourtike]
mysql -u root -pmysql < ./../../../sql/20150201-tourtike-phase1.sql

: 2015年03月作成
: --- 某飲食店向け 予約サイト[solare]
mysql -u root -pmysql < ./../../../sql/20150202-solare-phase1.sql

: -------------------------------------------------------------------------------------------------
: 201503 <201503月生>
: -------------------------------------------------------------------------------------------------
: 2015年04月作成
: 某旅行会社向け 旅行チケット販売サイト
mysql -u root -pmysql < ./../../../sql/20150301-worldtravel-phase1.sql

: 2015年04月作成
: 某旅行会社向け 宝石発掘ツアー予約サイト[youjustjewelry]
mysql -u root -pmysql < ./../../../sql/20150301-youjustjewelry-phase1.sql

: 2015年05月作成
: 某一般消費者向け コーヒー豆販売サイト
mysql -u root -pmysql < ./../../../sql/gpscoffee.sql

: -------------------------------------------------------------------------------------------------
: 201504 <201504月生>
: -------------------------------------------------------------------------------------------------
: 2015年05月作成
: 某フィギュア・ホビー販売サイト（改修版）
: mysql -u root -pmysql < ./../../../sql/20150401-lapoupee-phase1.sql

: 2015年06月作成
: 某自転車レンタルサイト
mysql -u root -pmysql < ./../../../sql/20150401-ucycle-phase1.sql

: -------------------------------------------------------------------------------------------------
: 201505 <201505月生>
: -------------------------------------------------------------------------------------------------
: 2015年06月作成
: 某ライブチケット販売サイト
: mysql -u root -pmysql < ./../../../sql/20150601-livetickets-phase1.sql

: 2015年06月作成
: 某野球観戦チケット販売サイト
: mysql -u root -pmysql < ./../../../sql/baseballticket.sql

: 2015年07月作成
: 某着物レンタルサイト
: mysql -u root -pmysql < ./../../../sql/ichigoichie.sql
: ---
: -------------------------------------------------------------------------------------------------
: 201506 <201506月生>
: -------------------------------------------------------------------------------------------------
: ---
mysql -u root -pmysql < ./../../../sql/releaseproject.sql

: 2015年07月作成
: 某ゲーム・ミュージックコンサートチケット販売専門サイト
: mysql -u root -pmysql < ./../../../sql/gtickets.sql

: 2015年07月作成
: 某映画館向け 映画鑑賞チケット販売サイト
mysql -u root -pmysql < ./../../../sql/movietickets.sql

: 2015年08月作成
: 某Tシャツ販売サイト
: mysql -u root -pmysql < ./../../../sql/tbox.sql
: ---
: -------------------------------------------------------------------------------------------------
: 201507 <201507月生>
: -------------------------------------------------------------------------------------------------
: 2015年08月作成
: 某プラネタリウム向け上映プログラムチケット販売サイト
: mysql -u root -pmysql < ./../../../sql/biggalaxy.sql

: 2015年09月作成
: 某コテージレンタル予約サイト
mysql -u root -pmysql < ./../../../sql/khome.sql
: ---
: -------------------------------------------------------------------------------------------------
: 201508 <201508月生>
: -------------------------------------------------------------------------------------------------
: 2015年09月作成
:  某水族館向けチケット販売サイト
mysql -u root -pmysql < ./../../../sql/aquarium.sql

: -------------------------------------------------------------------------------------------------
: 201509 <201509月生>
: -------------------------------------------------------------------------------------------------
: 2015年10月作成
: 某ミュージカル劇団向けチケットサイト販売サイト
mysql -u root -pmysql < ./../../../sql/lereve.sql

: 2015年11月作成
: 某書籍レーベルサイト向け 書籍販売サイト
mysql -u root -pmysql < ./../../../sql/shizuku.sql
: ---
: -------------------------------------------------------------------------------------------------
: 201510 <201510月生>
: -------------------------------------------------------------------------------------------------
: 2015年11月作成
: 某旅行代理店向け チケット販売サイト
mysql -u root -pmysql < ./../../../sql/footprinter.sql

: 2015年11月作成
: 某スポーツジム向け チケット販売サイト
mysql -u root -pmysql < ./../../../sql/ukiukiutopia.sql

: 2015年12月作成
: 某ピザ配達会社向け ピザ販売サイト
mysql -u root -pmysql < ./../../../sql/pizzaseijin.sql
: ---
: -------------------------------------------------------------------------------------------------
: 201511 <201511月生>
: -------------------------------------------------------------------------------------------------
: 2015年12月作成
: 某一般消費者向け 総合映画チケット販売サイト
: mysql -u root -pmysql < ./../../../sql/cinemajapan.sql

: 2016年01月作成
: 某一般消費者向け チョコレート販売サイト
mysql -u root -pmysql < ./../../../sql/chocotime.sql
: ---
: -------------------------------------------------------------------------------------------------
: 201512 <201512月生>
: -------------------------------------------------------------------------------------------------
: 2016年01月作成
: 一般消費者向け 落語チケット販売サイト
mysql -u root -pmysql < ./../../../sql/rakuraku.sql
: 一般消費者向け 和菓子専門販売サイト
mysql -u root -pmysql < ./../../../sql/kinnosawa.sql
: ---
: -------------------------------------------------------------------------------------------------
: 201601 <201601月生>
: -------------------------------------------------------------------------------------------------
: ---
: 一般消費者向け テーマパークチケット販売サイト
mysql -u root -pmysql < ./../../../sql/mackeypark.sql
: 一般消費者向け ラーメン販売サイト
mysql -u root -pmysql < ./../../../sql/kuruyama.sql
: ---
: -------------------------------------------------------------------------------------------------
: [201603] 201602
: -------------------------------------------------------------------------------------------------
: ---
: 一般消費者向け 舞台チケット予約サイト
mysql -u root -pmysql < ./../../../sql/gekidanroadshow.sql
: 某着物レンタルサイト[Phase2]
: mysql -u root -pmysql < ./../../../sql/ichigoichie.sql
: ---
: -------------------------------------------------------------------------------------------------
: [201604] 201603
: -------------------------------------------------------------------------------------------------
: ---
: 健康通信販売サイト [uesto][phase2]
mysql -u root -pmysql < ./../../../sql/uesto.sql
: 某飲食店向け 予約サイト	 [solare][phase2]
mysql -u root -pmysql < ./../../../sql/solare.sql
: -------------------------------------------------------------------------------------------------
: ---
: -------------------------------------------------------------------------------------------------
: [201605] 201603 & 201604
: -------------------------------------------------------------------------------------------------
: ---
:
mysql -u root -pmysql < ./../../../sql/lapoupee.sql
:
mysql -u root -pmysql < ./../../../sql/gtickets.sql
:
mysql -u root -pmysql < ./../../../sql/chikezon.sql
: ---
: -------------------------------------------------------------------------------------------------
: [201606] 201604 & 201605
: -------------------------------------------------------------------------------------------------
: ---
:
mysql -u root -pmysql < ./../../../sql/live.sql
:
mysql -u root -pmysql < ./../../../sql/baseballticket.sql
:
mysql -u root -pmysql < ./../../../sql/ichigoichie.sql
:
mysql -u root -pmysql < ./../../../sql/tbox.sql
:
mysql -u root -pmysql < ./../../../sql/biggalaxy.sql
:
mysql -u root -pmysql < ./../../../sql/cinemajapan.sql

: ---
: -------------------------------------------------------------------------------------------------
: [201607] 201605 & 201606
: -------------------------------------------------------------------------------------------------
: ---
: mysql -u root -pmysql < ./../../../sql/internousdev.sql
: mysql -u root -pmysql < ./../../../sql/openconnect.sql
mysql -u root -pmysql < ./../../../sql/visa.sql
: ---
: -------------------------------------------------------------------------------------------------
: [201608] 201606 & 201607
: -------------------------------------------------------------------------------------------------
: ---
: mysql -u root -pmysql < ./../../../sql/internousdev.sql
mysql -u root -pmysql < ./../../../sql/rewrite.sql
mysql -u root -pmysql < ./../../../sql/miramode.sql
: ---
: -------------------------------------------------------------------------------------------------
: [201609] 201607 & 201608
: -------------------------------------------------------------------------------------------------
: ---
mysql -u root -pmysql < ./../../../sql/internousdev.sql
mysql -u root -pmysql < ./../../../sql/201609-openconnect.sql
mysql -u root -pmysql < ./../../../sql/20160901-mastercard.sql
mysql -u root -pmysql < ./../../../sql/20160901-americanexpress.sql
mysql -u root -pmysql < ./../../../sql/20160901-samurai.sql
: ---
: -------------------------------------------------------------------------------------------------
: [201610] 201608 & 201609
: -------------------------------------------------------------------------------------------------
mysql -u root -pmysql < ./../../../sql/20161001-nagomi.sql
: ---
: -------------------------------------------------------------------------------------------------
: [201611] 201609 & 201610
: -------------------------------------------------------------------------------------------------
mysql -u root -pmysql < ./../../../sql/20161101-noel.sql

mysql -u root -pmysql < ./../../../sql/20161101-lusso.sql

pause